In [414]:
import numpy as np 
import pandas as pd 
import os
import

In [415]:
pwd = os.getcwd()
file_path = os.path.join(pwd, 'DataAnalyst.csv')

In [416]:
df = pd.read_csv(file_path)

In [417]:
df.drop(columns="Unnamed: 0",inplace=True)

check for missing value

In [418]:
missing_value = df.isnull().sum()
missing_value

Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         1
Location             0
Headquarters         0
Size                 0
Founded              0
Type of ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy Apply           0
dtype: int64

In [419]:
df["Company Name"].fillna(value="Unknown",inplace=True)

In [420]:
df.replace(-1,np.nan,inplace=True)
df.replace(-1.0,np.nan,inplace=True)
df.replace("-1",np.nan,inplace=True)

In [421]:
df["Salary Estimate"].fillna(0,inplace=True)

In [422]:
df['Company Name']=df['Company Name'].str.split('\n', 1,expand=True)

In [423]:
df[['Job Title','Department']]=df['Job Title'].str.split(',',1, expand=True)

In [424]:
df[["Job Title","Department"]] = df[["Job Title","Department"]].astype(str)

In [425]:
df["Salary Estimate"] = df["Salary Estimate"].str.split("(",1,expand=True)

In [426]:
df[["Min Salary","Max Salary"]] = df["Salary Estimate"].str.split("-",expand=True)

In [427]:
df["Min Salary"] = df["Min Salary"].str.lstrip("$").str.rstrip("K").fillna(0).astype(int)

In [428]:
df["Max Salary"] = df["Max Salary"].str.lstrip("$").str.rstrip("K ").fillna(0).astype(int)

In [429]:
df.drop(columns="Salary Estimate",inplace=True)

In [430]:
avgcol = df[["Min Salary","Max Salary"]]

In [431]:
df["Average Salary"] = avgcol.mean(axis=1)

In [432]:
df["Competitors"].fillna(value="No",inplace=True)

In [433]:
df["Competitors_a"] = df["Competitors"].map(lambda x:x.split(", "))

In [434]:
No_of_Openings_job_title =pd.DataFrame(df[df['Easy Apply']=="True"]['Job Title'].value_counts()).rename(columns={'Job Title':'No_of_openings'})

In [435]:
No_of_Openings_job_title = No_of_Openings.reset_index()

In [436]:
No_of_Openings_job_title.rename(columns={"index":"Job Title"})

    level_0                                          Job Title  No_of_openings
0         0                                       Data Analyst              17
1         1                                Senior Data Analyst               8
2         2                        Senior Product Data Analyst               2
3         3                                  Lead Data Analyst               2
4         4                                     Senior Analyst               2
5         5                       Data Base Programmer/Analyst               2
6         6                        Senior Data Quality Analyst               2
7         7               Data Analyst Alteryx Experience MUST               1
8         8                             Outsights Data Analyst               1
9         9                          Supply Chain Data Analyst               1
10       10                           Application Data Analyst               1
11       11                          Quantitative Data Analyst               1
12       12                            Healthcare Data Analyst               1
13       13                                Data Analyst Intern               1
14       14                            Operations Data Analyst               1
15       15                             Product Analyst - Data               1
16       16            Signal Processing Engineer/Data Analyst               1
17       17                               Data Quality Analyst               1
18       18                       Live Operations Data Analyst               1
19       19                                  Data Analyst - Sr               1
20       20                Business Analyst/Data Domain Expert               1
21       21                            Data Production Analyst               1
22       22                                Client Data Analyst               1
23       23                   Business Analyst/Data Consultant               1
24       24        Senior Marketing Data Analyst (Real Estate)               1
25       25                            Data Operations Analyst               1
26       26  Senior Data Analyst - Finance & Platform Analy...               1
27       27  Data Analyst (Supply Chain) - May Reside Anywh...               1
28       28                    Senior Data Analyst Informatics               1
29       29                      Senior Financial Data Analyst               1
30       30                            Data Validation Analyst               1
31       31                               Product Data Analyst               1
32       32                                     Senior Manager               1
33       33            Senior Data Analyst (Product Analytics)               1
34       34                              Business Data Analyst               1
35       35                                System/Data Analyst               1
36       36                    Strategic Sourcing Data Analyst               1
37       37                      Senior Marketing Data Analyst               1
38       38                             Reporting Data Analyst               1
39       39                                   GIS Data analyst               1
40       40                Data Analyst- Win 10 Migration- NYC               1
41       41                             Financial Data Analyst               1
42       42                       Alerts Business/Data Analyst               1
43       43                                    BI/Data Analyst               1
44       44                               Data Science Analyst               1
45       45                     Compensation & HR Data Analyst               1
46       46                              Data Security Analyst               1
47       47                                    Data Analyst II               1
48       48                                Data Analyst 127909               1
49       49                             TECHNICAL DATA ANALYST               1
50       50                                    HR Data Analyst               1
51       51                           AI Insights Data Analyst               1

In [437]:
df["Revenue"].value_counts()

Unknown / Non-Applicable            615
$100 to $500 million (USD)          218
$50 to $100 million (USD)           199
$10+ billion (USD)                  189
$10 to $25 million (USD)            132
$2 to $5 billion (USD)              129
$1 to $5 million (USD)              111
$25 to $50 million (USD)            110
Less than $1 million (USD)           93
$1 to $2 billion (USD)               87
$500 million to $1 billion (USD)     79
$5 to $10 million (USD)              72
$5 to $10 billion (USD)              56
Name: Revenue, dtype: int64

In [438]:
df["Average Salary"].astype(int)

0       51
1       51
2       51
3       51
4       51
        ..
2248    91
2249    91
2250    91
2251    91
2252    91
Name: Average Salary, Length: 2253, dtype: int32

In [439]:
revenue_salary = pd.DataFrame(df.groupby("Revenue")["Average Salary"].mean()).sort_values(by="Average Salary", ascending=False)

In [440]:
revenue_salary.reset_index()

                             Revenue  Average Salary
0             $1 to $5 million (USD)       75.941441
1           $25 to $50 million (USD)       73.972727
2            $5 to $10 billion (USD)       73.732143
3           Unknown / Non-Applicable       73.496748
4         $100 to $500 million (USD)       71.830275
5             $2 to $5 billion (USD)       71.794574
6         Less than $1 million (USD)       70.903226
7           $10 to $25 million (USD)       70.553030
8                 $10+ billion (USD)       70.457672
9            $5 to $10 million (USD)       70.451389
10            $1 to $2 billion (USD)       70.327586
11  $500 million to $1 billion (USD)       69.829114
12         $50 to $100 million (USD)       68.834171

In [441]:
df["Founded"].fillna(-1,inplace=True)

In [442]:
df["no_year"] = 2021-df["Founded"]

In [443]:
df["no_year"].replace(2022.0,0,inplace=True)

In [444]:
Com_Age_salary = pd.DataFrame(df.groupby("no_year")["Average Salary"].mean()).sort_values(by="Average Salary", ascending=False)
Com_Age_salary.reset_index()

     no_year  Average Salary
0      114.0           138.5
1       97.0           138.5
2       95.0           122.5
3       93.0           113.0
4      164.0           113.0
..       ...             ...
156    154.0            41.5
157    165.0            39.5
158    152.0            37.5
159    171.0            36.5
160    156.0            36.0

[161 rows x 2 columns]

In [445]:
Com_age_revenue = pd.DataFrame(df.groupby("Revenue")["no_year"].mean()).sort_values(by="no_year", ascending=False)

In [446]:
Com_age_revenue

                                    no_year
Revenue
$10+ billion (USD)                97.650794
$5 to $10 billion (USD)           67.732143
$2 to $5 billion (USD)            66.069767
$1 to $2 billion (USD)            55.988506
$500 million to $1 billion (USD)  37.189873
$100 to $500 million (USD)        30.559633
$50 to $100 million (USD)         25.005025
$25 to $50 million (USD)          21.909091
$10 to $25 million (USD)          19.053030
Unknown / Non-Applicable          18.100813
$1 to $5 million (USD)             7.909910
$5 to $10 million (USD)            6.847222
Less than $1 million (USD)         2.946237

In [447]:
Com_age_revenue_salary = pd.merge(left = revenue_salary, right = Com_age_revenue, how ="outer", left_on = ["Revenue"], right_on = ["Revenue"])

In [448]:
output = Com_age_revenue_salary.copy()

In [449]:
output.to_excel(pwd + "//Com_age_revenue_salary.xlsx",index=False)

In [450]:
df.drop(columns="Competitors_a",inplace=True)

In [451]:
output_1 = df.copy()

In [452]:
output_1.to_excel(pwd + "//outputData.xlsx",index=False)